app/controllers/acutes_controller.rb

SELECT "acutes".* FROM "acutes"
---
  def index
    @acutes = Acute.all