app/controllers/chronics_controller.rb

  def index
    @chronics = Chronic.where("patient_id = ?", params[:p_id])
---
SELECT "chronics".* FROM "chronics" WHERE (patient_id = '1')

  def create
    @chronic = Chronic.new(chronic_params)

    respond_to do |format|
      if @chronic.save
---
INSERT INTO "chronics" ("date_created", "discomfort_score", "patient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["date_created", 2016-12-17 21:08:00 UTC], ["discomfort_score", 6.0], ["patient_id", 1], ["created_at", 2016-12-17 21:09:14 UTC], ["updated_at", 2016-12-17 21:09:14 UTC]]

  def destroy
    @chronic.destroy
---
DELETE FROM "chronics" WHERE "chronics"."id" = ?  [["id", 2]]

    def set_chronic
      @chronic = Chronic.find(params[:id])
---
SELECT  "chronics".* FROM "chronics" WHERE "chronics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]