app/controllers/doctors_controller.rb

INSERT INTO "doctors" ("name", "password", "created_at", "updated_at", "email") VALUES (?, ?, ?, ?, ?)  [["name", "jack"], ["password", "1234"], ["created_at", 2016-12-12 16:47:50 UTC], ["updated_at", 2016-12-12 16:47:50 UTC], ["email", "hasdf@gamil.com"]]
---
  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save

UPDATE "doctors" SET "password" = ?, "updated_at" = ? WHERE "doctors"."id" = ?  [["password", "12345"], ["updated_at", 2016-12-18 04:40:32 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @doctor.update(doctor_params)

DELETE FROM "doctors" WHERE "doctors"."id" = ?  [["id", 1]]
---
  def destroy
    @doctor.destroy