app/controllers/patients_controller.rb

INSERT INTO "patients" ("name", "password", "doctor_id", "created_at", "updated_at", "email") VALUES (?, ?, ?, ?, ?, ?)  [["name", "alice"], ["password", "234"], ["doctor_id", 1], ["created_at", 2016-12-12 16:48:14 UTC], ["updated_at", 2016-12-12 16:48:14 UTC], ["email", "asdf@gmail.com"]]
---
  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save